Imports PVZHelper.Cli

Module Controller
    Public ReadOnly pList() As String = {"豌豆射手", "向日葵", "樱桃炸弹", "坚果", "土豆地雷",
        "寒冰射手", "大嘴花", "双重射手", "小喷菇", "阳光菇", "大喷菇", "咬咬碑",
        "迷糊菇", "胆小菇", "冰川菇", "末日菇", "莲叶", "窝瓜", "三重射手", "缠绕水草",
        "火爆辣椒", "地刺", "火炬树桩", "高坚果", "水兵菇", "路灯花", "仙人掌",
        "三叶草", "双向射手", "星星果", "南瓜头", "磁力菇", "卷心菜投手", "花盆",
        "玉米投手", "咖啡豆", "大蒜", "萝卜伞", "金盏花", "西瓜投手", "机枪射手",
        "双胞向日葵", "多嘴小蘑菇", "猫尾草", "冰西瓜", "吸金菇", "刚地刺", "玉米加农炮",
        "反向双重射手", "红坚果", "巨坚果"}
    Public ReadOnly zList() As String = {"普通", "旗子", "路障", "撑杆", "铁桶", "读报",
        "铁网门", "橄榄球", "舞者", "伴舞", "鸭子", "潜水", "雪橇车", "雪橇", "海豚",
        "小丑", "气球", "矿工", "跳跳", "雪人", "飞贼", "梯子", "投石车", "巨人", "小鬼",
        "僵博", "豌豆", "坚果", "辣椒", "机枪", "窝瓜", "高坚果", "红眼巨人"}
    Public ReadOnly bList() As String = {"草地", "裸地", "水池"}
    Public ReadOnly nList() As Integer = {1, 2, 3, 4, 5, 6}
    Public ReadOnly rList() As String = {"不出怪", "陆路", "水路"}
    Public ReadOnly mList() As String = {"冒险模式", "白天简单", "黑夜简单", "泳池简单",
        "浓雾简单", "屋顶简单", "白天困难", "黑夜困难", "泳池困难", "浓雾困难",
        "屋顶困难", "白天无限", "黑夜无限", "泳池无限", "浓雾无限", "屋顶无限",
        "植物僵尸", "坚果保龄球", "拉霸", "种子雨", "僵尸迷阵", "隐形战争",
        "观星", "僵尸水族馆", "僵尸迷阵 旋风", "小小大僵尸", "斗转星移", "排山倒海",
        "全面冻结", "僵尸快跑", "打僵尸", "坚不可摧", "植物僵尸2", "坚果保龄球2",
        "跳跳舞会", "僵尸博士的复仇", "当艺术遇上坚果", "晴天", "无草皮之地", "重要时间",
        "当艺术遇上向日葵", "空袭", "急冻先锋", "牛顿的力量", "坟墓危险", "地道战",
        "暴风雨之夜", "飞贼闪击战", "松鼠", "花瓶终结者无限", "僵尸公敌无限"}
    Public ReadOnly izeList() As String = {"豌豆阵", "大嘴地雷阵", "地刺杨桃阵", "大喷磁铁阵", "胆小阵",
        "大杂烩阵1", "大杂烩阵2", "大杂烩阵3"}
    Public ReadOnly cnList() As Integer = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10}
    Public ReadOnly czList() As String = {"普通", "路障", "撑杆", "铁桶", "扶梯", "矿工", "飞贼", "橄榄球", "气球", "铁网门", "雪橇车", "跳跳", "舞者", "巨人", "小鬼"}
    Public ReadOnly fList() As String = {"豌豆射手", "向日葵", "樱桃炸弹", "坚果", "土豆地雷",
        "寒冰射手", "大嘴花", "双重射手", "小喷菇", "阳光菇", "大喷菇", "咬咬碑",
        "迷糊菇", "胆小菇", "冰川菇", "末日菇", "莲叶", "窝瓜", "三重射手", "缠绕水草",
        "火爆辣椒", "地刺", "火炬树桩", "高坚果", "水兵菇", "路灯花", "仙人掌",
        "三叶草", "双向射手", "星星果", "南瓜头", "磁力菇", "卷心菜投手", "花盆",
        "玉米投手", "咖啡豆", "大蒜", "萝卜伞", "金盏花", "西瓜投手", "机枪射手",
        "双胞向日葵", "多嘴小喷菇", "猫尾草", "冰西瓜", "吸金菇", "钢地刺", "玉米加农炮", "变身茄子",
        "红坚果", "巨坚果"}
    Public ReadOnly fsList() As String = {"幼苗", "小花", "中花", "大花"}
    Public ReadOnly fpList() As String = {"花园", "蘑菇园", "手推车", "水族馆"}
    Public ReadOnly Helper As New PVZController()
End Module
